rails-in-action/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params.require(:post).permit(:post))
    @post.user = current_user
    @post.save
---
INSERT INTO "posts" ("post", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post", "Hello from the otherside"], ["user_id", 1], ["created_at", "2015-12-14 03:00:37.435121"], ["updated_at", "2015-12-14 03:00:37.435121"]]