rails-in-action/app/controllers/users_controller.rb

  def index
    page = params.permit(:page)[:page]
    @users = User.where.not(:id => current_user).paginate(:page => page, :per_page => 10)
---
SELECT "users".* FROM "users" WHERE ("users"."user" != 1)

  def follow
    followed_user = User.find_by(id: params.require(:followed_user))
    follow = Follow.new(followed: followed_user, follower: current_user)
    follow.save!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "follows" ("followed_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["followed_id", 1], ["follower_id", 2], ["created_at", "2015-12-15 01:13:42.127586"], ["updated_at", "2015-12-15 01:13:42.127586"]]